
keywords = {'Security': ['опасн', 'парол', 'пасс', "логин", 'учет', 'авторизац', 'имя', 'данные', 'login', 'pass', 'name', 'data','письмо', ''],
'Refunds':['деньг', 'средств','возврат', 'монебэк', 'подписк', '','', '','', '','', '','', '','', '','', ''],
'Troubleshooting':['проблем', 'траблы', 'лаг', 'глюк', 'корректн', 'баг', 'ошибк', 'задержк', 'производителпарол', 'загруз', 'выгруз', 'обновлен', '', '', '', '', '', ''],
'Account': ['логин', 'авторизац','парол', 'вход','выход', 'подсписк','аккаунт', 'войти', 'выйти', 'письмо','', '','', '','', '','', ''],
'Advertising and Collaboration':['колаб', 'коллаб', 'сотрудничеств', 'участие', 'реклам', '','', '','', '','', '','', '','', '','', ''],
'Limits':['врем', 'срок', 'лимит', 'верси','', '','', '','', '','', '','', '','', '','', ''],
'Payments':['подписк', 'автопродлен','деньги', 'денег','оплат', 'плат','оплач', 'наличн','', '','', '','', '','', '','', ''],
'Features':['сервис', 'функци', 'подписк', 'когда', 'суммаризац', 'верс','', '','', 'API','обновлен', '','', '','', '','', '']
}
